export class HoggValueAnd {
  /**
   * МОТИВАЦИЯ: допустим мы хотим получить значение ячейки столбца, но такого столбца не существует; в этом случае
   * возврат просто значения не позволяет понять, это значение ячейки или же ячейки не существует.
   *
   * @param value
   * @param isValueExist (1) -- если здесь FALSE то это означает что значение поля {@link value} не следует брать во
   * внимание т.к. на самом деле значения получить не удалось (например сущности из которой предполагается взять
   * значение просто не существует)
   */
  constructor(readonly value: string, readonly isValueExist: boolean = true) {
  }
}
